<!DOCTYPE doctype PUBLIC "-//w3c//dtd html 4.0 transitional//en">
<html><head>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <meta name="Author" content="Francisco Saiz">
  <meta name="GENERATOR" content="Microsoft FrontPage 5.0"><title>Reglas de calificaci&oacute;n</title></head>

<body>
<center>
<h3> <font size="+2">Normas de calificaci&oacute;n</font></h3>
</center>
<h3> Reglas comunes a ambas convocatorias</h3>
<ul>
  <li> Para aprobar el curso es necesario aprobar las pr&aacute;cticas y
la teor&iacute;a. En tal caso, la nota final se calcula mediante
"0.4*nota-practicas+0.6*nota-teor&iacute;a". En caso contrario, la nota final 
  ser&aacute; "minimo (4.9, media final)".</li>
  <li> Las pr&aacute;cticas aprobadas el curso pasado se podr&aacute;n convalidar como un 5 en 
  pr&aacute;cticas, siempre que el alumno haya obtenido una nota de teor&iacute;a superior a 3 
  el a&ntilde;o anterior. Deberá solicitarse la convalidación al coordinador de 
  prácticas durante la primera semana del curso.</li>
  <li> Ser&aacute; requisito para poder puntuar tanto en teor&iacute;a como en pr&aacute;cticas que 
  la totalidad del trabajo solicitado al alumno, a lo largo del curso y en el 
  examen de teor&iacute;a, sea original y propio del alumno que lo presenta.</li>
</ul>
<h3> Convocatoria ordinaria</h3>
<ul>
  <li> Teor&iacute;a<ul>
      <li> La nota de teor&iacute;a se calcula mediante
"maximo(nota-examen, 0.3*nota-parcial+0.7*nota-examen)".</li>
      <li> Si (y s&oacute;lo si) un alumno se presenta al examen final consume una convocatoria.</li>
      <li> Si suspende la convocatoria ordinaria (junio) y la nota de teor&iacute;a
corresponde a un aprobado, esta nota de teor&iacute;a se conserva para
la convocatoria de septiembre.</li>
    </ul>
  </li><li>Pr&aacute;cticas<ul>
  <li>Esta nota se calcula como el promedio de todas las notas
obtenidas en las distintas pr&aacute;cticas del curso. Se conserva para
la convocatoria de septiembre, siempre que corresponda a un aprobado.</li>
  <li>Se har&aacute;n evaluaciones individuales de pr&aacute;cticas los d&iacute;as de entrega, y al 
  final del curso, necesarias para aprobar las pr&aacute;cticas. Ambos 
  componentes de cada pareja de prácticas deberán poder responder de la totalidad 
  de la práctica entregada. Es obligatoria la 
  asistencia en los d&iacute;as de entrega.</li>
</ul>
  </li>
</ul>
<h3> Convocatoria septiembre</h3>
<ul>
  <li> Pr&aacute;cticas: desarrollo de un proyecto (m&aacute;s complejo que las
pr&aacute;cticas normales del curso) que se especificar&aacute; en la
fecha oportuna.</li>
  <li> Si el alumno se presenta al examen final consume una convocatoria.</li>
</ul>
</body></html>