<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>

  <meta content="text/html; charset=utf-8" http-equiv="CONTENT-TYPE">
  <title>POO: la memoria</title>







  <link rel="stylesheet" href="poo.css">




  <meta http-equiv="CONTENT-TYPE" content="text/html; charset=utf-8">
</head>

<body>
<p class="cabecera">Programaci&oacute;n Orientada a Objetos. Curso 06/07</p>


<h1 style="text-align: center;">Gu&iacute;a para la elaboraci&oacute;n de memorias de pr&aacute;cticas<br>
</h1>


<hr style="width: 100%; height: 2px;">
<br>

<h3>Consideraciones iniciales: 多Para qu&eacute; sirve una memoria?<br>
</h3>

<p>En las clases de pr&aacute;cticas, su uso principal es como lectura <span style="font-style: italic;">antes</span> de entrar a evaluar&nbsp; el
c&oacute;digo de una entrega. Es
decir, debe responder de forma r&aacute;pida y directa a las siguientes
preguntas: 多qu&eacute; han hecho y c&oacute;mo? 多por qu&eacute; as&iacute; y no de otra manera?
多c&oacute;mo
lo han probado?.</p>

<p>De cara a vuestra vida profesional, esto es un ejercicio de
redacci&oacute;n de documentaci&oacute;n t&eacute;cnica. Todo c&oacute;digo que se escriba o
mantenga deber&aacute; ir acompa&ntilde;ado de documentaci&oacute;n. Si esta documentaci&oacute;n
no es clara y legible, el mantenimiento del c&oacute;digo se dificulta de
sobremanera. Adem&aacute;s, en un entorno de producci&oacute;n, hay que cuidar la
presentaci&oacute;n de la documentaci&oacute;n, ateni&eacute;ndose a reglamentos internos
sobre estilos de portada, estructuraci&oacute;n del contenido y tipos de
fuentes admisibles.<br>
</p>

<h3>Estructura recomendada de una memoria<br>
</h3>

Una memoria debe consistir de <a href="#portada">portada</a>, <a href="#intro">introducci&oacute;n</a>, <a href="#analisis">an&aacute;lisis</a> y <a href="#pruebas">pruebas</a>:<br>

<br>

<div style="margin-left: 40px;"><span style="font-weight: bold;"><a name="portada"></a>Portada</span> (1 p&aacute;gina, o bastante menos en el
caso de documentaci&oacute;n .html), <br>

<br>

</div>

<div style="margin-left: 80px;">En la que aparezca:</div>

<div style="margin-left: 80px;">
<ul>

  <li>El nombre de la asignatura, </li>
  <li>El nombre y n&uacute;mero de la pr&aacute;ctica, </li>
  <li>La letra de grupo de la pareja de pr&aacute;cticas, y su n&uacute;mero</li>
  <li>El nombre de ambos integrantes de la pareja.<br>
</li>
  <li>Se recomienda tambien incluir las direcciones de correo de ambos
integrantes.</li>
</ul>

</div>

<div style="margin-left: 40px;"><span style="font-weight: bold;"><a name="intro"></a>Introducci&oacute;n</span> (dos o tres p&aacute;rrafos), <br>

<br>

</div>

<div style="margin-left: 80px;">En la que se explica de forma resumida
el objetivo de la pr&aacute;ctica. No se trata de copiar el enunciado, sino de
resumirlo en pocas palabras, para dar pie a las explicaciones
posteriores.<span style="font-weight: bold;"><br>
<br>
</span></div>

<div style="margin-left: 40px;"><span style="font-weight: bold;"><a name="analisis"></a>An&aacute;lisis</span> del problema (hasta 6 caras,
seg&uacute;n complejidad), <br>

<br>

</div>

<div style="margin-left: 80px;">En el que se explican c&oacute;mo se ha
afrontado el problema y qu&eacute; es lo que se ha hecho.&nbsp;</div>

<div style="margin-left: 80px;">Se recomienda:</div>

<ul style="margin-left: 80px;">

  <li>Incluir discusiones sobre m&eacute;todos alternativos de resoluci&oacute;n, y
porqu&eacute; no se han elegido.</li>

  <li>Usar pseudoc&oacute;digo para explicar fragmentos de c&oacute;digo
especialmente importantes.</li>

  <li>Usar esquemas cuando resulten ilustrativos (ascii-art inclusive).</li>

</ul>

<div style="margin-left: 80px;">Se debe evitar por todos los medios:<br>

<ul>

  <li>Incluir c&oacute;digo java real, o <span style="font-style: italic;">javadoc</span>, o enumerar todas las clases
generadas junto con sus funciones. S&oacute;lo se deben incluir "firmas" de
funciones (la <span style="font-style: italic;">firma</span> de un
m&eacute;todo en Java es equivalente al <span style="font-style: italic;">prototipo</span>
de una funci&oacute;n en C) cuando esa funci&oacute;n merezca una explicaci&oacute;n m&aacute;s detallada, pero nunca como regla
general.</li>
  <li>Incluir esquemas que no aporten informaci&oacute;n nueva y relevante.</li>
</ul>

</div>

<div style="margin-left: 40px;"><span style="font-weight: bold;"><a name="pruebas"></a>Pruebas</span> (en torno a 1 cara)<br>

<br>

</div>

<div style="margin-left: 80px;">En la que se detallan aspectos de
control de errores y el tipo de pruebas al que ha sido sometido el
programa. La secci&oacute;n de pruebas debe detallar:</div>

<div style="margin-left: 40px;">
<ul>
  <ul>
    </ul></ul></div>

<div style="margin-left: 80px;">
<ul>
  <li>El tipo de condiciones de error que el programa puede detectar
y c&oacute;mo se comportar&aacute; ante ellas.</li>
  <li>Aquellas condiciones de error que no est&aacute;n contempladas.</li>
  <li>Una enumeraci&oacute;n de las pruebas a las que ha sido sometido el
programa. No se trata de proporcionar un volcado de pantalla de N
ejecuciones, sino de proporcionar a un futuro mantenedor la descripci&oacute;n
de una serie de pruebas que se sabe que funcionan. Y las que no.<br>
  </li>
  <ul>

  
  </ul>

</ul>
</div>

<div style="margin-left: 40px;">
<ul>
  <ul>

    
  </ul>
</ul>
</div>

<div style="margin-left: 40px;">
<ul>
  <ul>

    
  </ul>
</ul>
</div>

<div style="margin-left: 80px;">
</div>


<div style="margin-left: 40px;"><span style="font-weight: bold;">Comentarios</span>
<span style="font-weight: normal;">(opcional, longitud variable). </span><br>
<span style="font-weight: normal;"></span><br>
<span style="font-weight: normal;"></span></div>

<div style="margin-left: 80px;"><span style="font-weight: normal;">Esta
secci&oacute;n no aparecer&iacute;a en una entrega "profesional", y sirve para dejar
comentarios al profesor del tipo de "quer&iacute;amos hacer X pero no lo
hicimos por falta de tiempo" o "sabemos c&oacute;mo hacer Y, aunque no lo
hemos hecho, y queremos explicarlo". O incluso quejarse de partes del
enunciado. <br>
<br>
</span><span style="font-weight: normal;"></span></div>

<div style="margin-left: 80px;">Si se tienen problemas durante la
realizaci&oacute;n de la pr&aacute;ctica, es muy recomendable detallarlos en esta
secci&oacute;n. Si una pr&aacute;ctica no funciona, y en ning&uacute;n lugar de la memoria
se comenta el fallo, da la impresi&oacute;n de que se est&aacute; intentando colar
gato por liebre.<br>
</div>

<h3>Presentaci&oacute;n y estilo de redacci&oacute;n<span style="font-weight: bold;"></span></h3>

<h3><span style="font-weight: bold;"></span></h3>

<p><span style="font-weight: bold;"></span>Una memoria de pr&aacute;cticas es
un entrenamiento para la documentaci&oacute;n t&eacute;cnica y las descripciones de
proyectos que os esperan en vuestra vida profesional. Se debe extremar
el cuidado con la claridad de la redacci&oacute;n y la correcci&oacute;n ortogr&aacute;fica
del texto. En este &uacute;ltimo punto, se ruega encarecidamente el uso de
correctores ortogr&aacute;ficos como parte de la elaboraci&oacute;n de la pr&aacute;ctica.</p>

<p>En cuanto a la presentaci&oacute;n, es importante evitar el uso de fuentes
no est&aacute;ndar o colores chillones en la memoria de la pr&aacute;ctica. Tambi&eacute;n
se recomienda mantener una estructura clara a lo largo del texto, con
apartados y subapartados seg&uacute;n se juzgue necesario. Si bien estos
aspectos "est&eacute;ticos" cuentan mucho menos que el contenido en s&iacute; en la
nota de una pr&aacute;ctica, no est&aacute; de m&aacute;s invertir el escaso tiempo
necesario para dejar las memorias elegantes, legibles, y bien
estructuradas. Y los profesores lo agradecer&aacute;n.<br>
</p>

<p><span style="font-weight: bold;"></span><span style="font-weight: bold;"></span></p>

<p><span style="font-weight: bold;"></span></p>

<span class="copyright">(C) 2006-2007, Escuela Polit&eacute;cnica Superior, UAM</span>

</body></html>
