<html><head>

  <meta content="text/html; charset=utf-8" http-equiv="CONTENT-TYPE"><title>POO: Normas</title>
  
  <link rel="stylesheet" href="poo.css">
  <meta http-equiv="CONTENT-TYPE" content="text/html; charset=utf-8"></head><body>
<p class="cabecera">Programaci&oacute;n Orientada a Objetos. Curso 08/09<span style="font-weight: bold;"></span></p><h1>Normas para el laboratorio de pr&aacute;cticas de POO</h1>

<hr>
<div style="text-align: right;"><big>[</big><big> </big><a href="http://www.ii.uam.es/%7Epoo/normas-calificacion.html">Ver
tambi&eacute;n las normas de teor&iacute;a</a><big> ]</big><br>
</div>

<p><span style="font-weight: bold;"></span><span style="font-weight: bold;"></span><span style="font-weight: bold;">1.
Peso de la nota de pr&aacute;cticas y
convalidaciones.<br>
</span></p>

<p style="margin-left: 40px;">Las pr&aacute;cticas cuentan un 40% de la nota
final de la asignatura. Para promediar es necesario aprobar
independientemente la teor&iacute;a y las pr&aacute;cticas. Se convalidar&aacute;n con una nota de 5 las
pr&aacute;cticas aprobadas de un a&ntilde;o para el siguiente, siempre que se contase con un 3 o
m&aacute;s en el examen de teor&iacute;a correspondiente. La convalidaci&oacute;n
se debe solicitar por correo electr&oacute;nico al coordinador de pr&aacute;cticas durante
el <span style="color: rgb(153, 0, 0);"><b>primer mes</b></span> de las mismas.
</p>

<p><span style="font-weight: bold;">2. Formaci&oacute;n de parejas y asistencia</span></p>

<div style="margin-left: 40px;">Los grupos de trabajo ser&aacute;n de 2
personas, que tienen que asistir a la clase de pr&aacute;cticas en el mismo
horario. Los cambios de grupo s&oacute;lo se podr&aacute;n realizar durante la
primera semana de clase, y quedan supeditados a la existencia de plazas
libres en el grupo de destino. La asistencia a clase es obligatoria
s&oacute;lo en los d&iacute;as de examen de pr&aacute;cticas (ver m&aacute;s adelante). Sin
embargo, es recomendable&nbsp; asistir regularmente, ya que esto
permite una evaluaci&oacute;n continua y facilita la correcci&oacute;n de las
pr&aacute;cticas.<br>
</div>

<p><span style="font-weight: bold;">3. Copia de pr&aacute;cticas</span><br>
</p>

<div style="margin-left: 40px;">Sera requisito para poder puntuar en
pr&aacute;cticas que la totalidad del trabajo entregado por el alumno a lo
largo
del curso sea original y propio del autor que lo presenta. La copia en
pr&aacute;cticas es una falta
grave que ser&aacute; objeto de sanci&oacute;n (que puede ser extensible al copiado).
En todos los casos de copia se aplicar&aacute; el Cap&iacute;tulo V de la <a href="http://www.ii.uam.es/%7Eestudiantes/normativas/normativa_evaluacion_EPS.pdf">normativa de evaluaci&oacute;n de la EPS</a>, que prevee <span style="color: rgb(153, 0, 0);">apertura de <span style="font-weight: bold;">expediente de expulsi&oacute;n</span> o bien <span style="font-weight: bold;">suspenso autom&aacute;tico sin posiblidad de presentarse a Septiembre</span></span>. El intercambio de <span style="font-style: italic;">ideas</span>
no se considera copia (es m&aacute;s, se recomienda encarecidamente). El
intercambio de c&oacute;digo fuente s&iacute;, y se castigar&aacute; como tal. El estudiante
es
responsable de evitar que su material evaluable (c&oacute;digo, problemas,
ejercicios, memorias de pr&aacute;cticas, etc.) sea accesible a estudiantes de
otros grupos de pr&aacute;cticas.<br>
<br>

</div>

<p><span style="font-weight: bold;">4. <a name="entrega"></a>Calendario
de entregas y retrasos<br>
</span></p>

<div style="margin-left: 40px;">Se realizar&aacute;n 4 pr&aacute;cticas durante el
cuatrimestre. Para aprobar la asignatura, es obligatorio haber
entregado
todas las pr&aacute;cticas. Los enunciados de una pr&aacute;ctica
estar&aacute;n disponibles a partir de la fecha de entrega de la pr&aacute;ctica
anterior. Las fechas de entrega de las pr&aacute;cticas se especifican en el
<a href="index.html#cal">calendario</a> y en el propio enunciado. <span style="color: rgb(153, 0, 0);">Los
alumnos que entreguen en </span><span style="font-weight: bold; color: rgb(153, 0, 0);">lunes</span><span style="color: rgb(153, 0, 0);">
deben hacerlo </span><span style="font-weight: bold; color: rgb(153, 0, 0);">como tarde 2 horas
antes</span><span style="color: rgb(153, 0, 0);">
del comienzo de la clase de pr&aacute;cticas. Aquellos alumnos que
entreguen&nbsp; </span><span style="font-weight: bold; color: rgb(153, 0, 0);">cualquier otro d&iacute;a</span><span style="color: rgb(153, 0, 0);">
de la semana tienen como plazo </span><span style="font-weight: bold; color: rgb(153, 0, 0);">las 23:59 del d&iacute;a
anterior</span><span style="color: rgb(153, 0, 0);">.</span>
Los retrasos dentro del mismo d&iacute;a de
entrega descontar&aacute;n un 20% de la nota. A partir del primer d&iacute;a de
retraso, cada d&iacute;a sucesivo resta otro 10% del total, lleg&aacute;ndose al 100%
a los 8 d&iacute;as de cumplirse el plazo. No se considera como entrega
aquella que s&oacute;lo contiene c&oacute;digo o s&oacute;lo contiene la memoria.<br>
</div>

<p><span style="font-weight: bold;">5. Forma de entrega y contenido de
los ficheros entregados</span><font color="#000000"><br>
</font></p>

<div style="margin-left: 40px;"><font color="#000000">Las pr&aacute;cticas </font>se
enviar&aacute;n como un &uacute;nico fichero mediante el <a href="http://www.eps.uam.es/esp/alumnos/practicas/envio_practicas.php3">sistema
de entrega de pr&aacute;cticas</a> de la Escuela. Este fichero incluir&aacute;
tanto la memoria como el c&oacute;digo fuente de la pr&aacute;ctica, <span style="font-weight: bold; color: rgb(153, 0, 0);">y no se debe
imprimir ni la memoria, ni el c&oacute;digo</span>. La entrega electr&oacute;nica
deber&aacute;
constar de un &uacute;nico archivo <i>.zip</i>. El nombre del fichero debe
ser
de la forma <br>
<div style="margin-left: 40px;">
<pre>p<span style="font-style: italic;">&lt;n&uacute;mero de pr&aacute;ctica&gt;&lt;letra de grupo&gt;&lt;n&uacute;mero de pareja, 2 d&iacute;gitos&gt;</span>.zip</pre>
</div>
As&iacute;, por ejemplo, la entrega de la pr&aacute;ctica 2 de la pareja n&uacute;mero 7 del
grupo "B" deber&aacute; llevar por nombre <br>
<pre style="margin-left: 40px;">p1b07.zip</pre>
El contenido del fichero cuyo contenido ser&aacute;, sin ning&uacute;n tipo de
subdirectorios (excepto los necesarios para aquellos ficheros .java
estructurados en paquetes), el siguiente:<br>
</div>

<ol style="margin-left: 40px;">

  <li>Un fichero llamado "leeme.txt" en el que se enumerar&aacute;n los
ficheros incluidos y su utilidad, a raz&oacute;n de una l&iacute;nea por fichero [<a href="ejemploLeeme.html">ver ejemplo</a>].</li>
  
  <li>Un fichero "memoria", en formato <span style="font-style: italic;">.ps</span>, <span style="font-style: italic;">.rtf</span>, o <span style="font-style: italic;">.pdf</span>, y con la extensi&oacute;n adecuada,
que contendr&aacute; la memoria [<a href="ejemploMemoria.html">ver gu&iacute;a de
elaboraci&oacute;n</a>].</li>
  <li>Los dem&aacute;s ficheros que se especifiquen en el enunciado de la
correspondiente pr&aacute;ctica, incluyendo el "script" <span style="font-style: italic;">ant</span> usado para compilar y ejecutar la entrega (<span style="font-style: italic;">build.xml</span>).</li>
</ol>

<div style="margin-left: 40px;"><span style="font-weight: bold; color: rgb(204, 0, 0);">NOTA: </span>Las
entregas que no cumplan uno o m&aacute;s de estos requisitos, incluido el
formato del nombre del fichero, ser&aacute;n penalizadas con <span style="font-weight: bold; color: rgb(153, 0, 0);">-0.5</span> puntos sobre
la nota definitiva de la pr&aacute;ctica.<span style="font-weight: bold; color: rgb(204, 0, 0);"> </span><span style="color: rgb(204, 0, 0);"></span>La
plataforma de referencia para ejecuci&oacute;n y compilaci&oacute;n es el entorno
Java, bajo Windows XP, de los laboratorios donde se imparte la
asignatura. <span style="font-weight: bold; color: rgb(153, 0, 0);">Toda pr&aacute;ctica entregada deber&aacute; poder compilar y ejecutar en ese entorno mediante la sentencia "ant run"</span>.<br>
</div>


<p><span style="font-weight: bold;">6. Correcci&oacute;n de las pr&aacute;cticas y
publicaci&oacute;n de notas<br>
</span></p>

<div style="margin-left: 40px;">Las pr&aacute;cticas se corrigen mediante
inspecci&oacute;n de lo entregado y con un examen presencial de cada pr&aacute;ctica.
El
examen tendr&aacute; lugar en la fecha se&ntilde;alada en el calendario de las
pr&aacute;cticas, publicado en la p&aacute;gina de la asignatura. Las notas de cada
entrega se publicar&aacute;n en la web de la asignatura.<br>
<br>
El d&iacute;a del examen correspondiente a cada entrega, <span style="font-style: italic;">ambos</span> autores deber&aacute;n estar
presentes ya que se har&aacute; un mini-examen escrito e individual (m&aacute;x. 20
minutos).&nbsp; En dicho examen se preguntar&aacute;n detalles concretos sobre
la implementaci&oacute;n de la pr&aacute;ctica, separando a ambos miembros de la pareja de pr&aacute;cticas.<br>
</div>

<p><span style="font-weight: bold;">7. Examen final de pr&aacute;cticas<br>
</span></p>

<div style="margin-left: 40px;">La &uacute;ltima semana de pr&aacute;cticas se
reserva para un examen de pr&aacute;cticas para aquellos alumnos que no han
podido asistir a alguna revisi&oacute;n, con entregas que no funcionan,
etc&eacute;tera. La lista de convocados se har&aacute; p&uacute;blica en la web de pr&aacute;cticas
una semana antes de la fecha del examen.<br>
</div>

<br>

<span class="copyright">(C) 2008-2009, Escuela Polit&eacute;cnica Superior, UAM</span>

</body></html>
